In [2]:
import pandas as pd

In [5]:
s = pd.Series(list('asdasdasdasdasda'))

In [6]:
s

0     a
1     s
2     d
3     a
4     s
5     d
6     a
7     s
8     d
9     a
10    s
11    d
12    a
13    s
14    d
15    a
dtype: object

In [7]:
s.unique()

array(['a', 's', 'd'], dtype=object)

In [8]:
s.value_counts()

a    6
d    5
s    5
dtype: int64

In [10]:
dados = pd.read_csv('dados/aluguel.csv',sep =';')
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento
5,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,50.00,Apartamento
6,Apartamento,Freguesia (Jacarepaguá),3,0,0,54,950.0,300.0,28.0,17.59,Apartamento
7,Apartamento,Barra da Tijuca,2,1,1,67,1700.0,589.0,147.0,25.37,Apartamento
8,Apartamento,Tijuca,2,1,0,110,1900.0,700.0,138.0,17.27,Apartamento
9,Apartamento,Olaria,3,1,0,68,1000.0,670.0,0.0,14.71,Apartamento

In [11]:
dados.Tipo.unique()

array(['Apartamento', 'Casa', 'Casa de Condomínio', 'Casa de Vila',
       'Quitinete'], dtype=object)

In [15]:
dados.Tipo.value_counts()

Apartamento           16923
Casa de Condomínio      964
Casa                    898
Quitinete               813
Casa de Vila            233
Name: Tipo, dtype: int64

In [16]:
m1 = 'CCcCCccCCCccCcCccCcCcCCCcCCcccCCcCcCcCcccCCcCcccCc'
m2 = 'CCCCCccCccCcCCCCccCccccCccCccCCcCccCcCcCCcCccCccCc'
m3 = 'CccCCccCcCCCCCCCCCCcccCccCCCCCCccCCCcccCCCcCCcccCC'
m4 = 'cCCccCCccCCccCCccccCcCcCcCcCcCcCCCCccccCCCcCCcCCCC'
m5 = 'CCCcCcCcCcCCCcCCcCcCCccCcCCcccCccCCcCcCcCcCcccccCc'

In [30]:
s_m1 = pd.Series(list(m1))
s_m2 = pd.Series(list(m2))
s_m3 = pd.Series(list(m3))
s_m4 = pd.Series(list(m4))
s_m5 = pd.Series(list(m5))
faces = ['Coroa', 'Cara']

In [31]:
s_m1.head()

0    C
1    C
2    c
3    C
4    C
dtype: object

In [35]:
data = {'Faces' : faces,
        'm1' : 's_m1',
        'm2' : s_m2,
        'm3' : s_m3,
        'm4' : s_m4,
        'm5' : s_m5}
df = pd.DataFrame(data, index = ['C','c'])
df

   Faces   m1   m2   m3   m4   m5
C  Coroa  NaN  NaN  NaN  NaN  NaN
c   Cara  NaN  NaN  NaN  NaN  NaN